# XDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Arc..::..XDirection Property
Arc Class See Also
---
Returns the X direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ XDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property XDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ XDirection {
	XYZ^ get ();
}
```

# See Also
Arc Class
Autodesk.Revit.DB Namespace